In [1]:
import pandas as pd

In [2]:
japan_events = pd.read_csv("../Data/GDELT/JapanEvents.csv")

In [3]:
japan_events.shape

(431756, 4)

In [4]:
japan_events.head()

    SQLDATE  EventRootCode  GoldSteinScale  NumMentions
0  20050401             18           -10.0            8
1  20050401             18           -10.0            6
2  20050405             18           -10.0            6
3  20050502              7             7.0           10
4  20050504              7             7.0           10

In [5]:
japan_events.tail()

         SQLDATE  EventRootCode  GoldSteinScale  NumMentions
431751  20230630              7             8.3            6
431752  20230630              5             8.0            6
431753  20230630              4             7.0            8
431754  20230630              3             5.2           10
431755  20230630              5             8.0            8

In [6]:
japan_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 431756 entries, 0 to 431755
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   SQLDATE         431756 non-null  int64
 1   EventRootCode   431756 non-null  int64
 2   GoldSteinScale  431756 non-null  float64
 3   NumMentions     431756 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 13.2 MB

In [7]:
japan_events.EventRootCode = japan_events.EventRootCode.astype(str)

In [8]:
japan_events.SQLDATE = pd.to_datetime(japan_events.SQLDATE, format="%Y%m%d")

In [9]:
japan_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 431756 entries, 0 to 431755
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   SQLDATE         431756 non-null  datetime64[ns]
 1   EventRootCode   431756 non-null  object
 2   GoldSteinScale  431756 non-null  float64
 3   NumMentions     431756 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 13.2+ MB

In [10]:
japan_events.head()

     SQLDATE EventRootCode  GoldSteinScale  NumMentions
0 2005-04-01            18           -10.0            8
1 2005-04-01            18           -10.0            6
2 2005-04-05            18           -10.0            6
3 2005-05-02             7             7.0           10
4 2005-05-04             7             7.0           10

In [11]:
japan_events.tail()

          SQLDATE EventRootCode  GoldSteinScale  NumMentions
431751 2023-06-30             7             8.3            6
431752 2023-06-30             5             8.0            6
431753 2023-06-30             4             7.0            8
431754 2023-06-30             3             5.2           10
431755 2023-06-30             5             8.0            8

In [12]:
japan_events.index

RangeIndex(start=0, stop=431756, step=1)

In [13]:
japan_events= japan_events.set_index('SQLDATE')

In [14]:
japan_events.head()

           EventRootCode  GoldSteinScale  NumMentions
SQLDATE
2005-04-01            18           -10.0            8
2005-04-01            18           -10.0            6
2005-04-05            18           -10.0            6
2005-05-02             7             7.0           10
2005-05-04             7             7.0           10

In [15]:
japan_events.tail()

           EventRootCode  GoldSteinScale  NumMentions
SQLDATE
2023-06-30             7             8.3            6
2023-06-30             5             8.0            6
2023-06-30             4             7.0            8
2023-06-30             3             5.2           10
2023-06-30             5             8.0            8

In [16]:
japan_events = japan_events.resample('D').mean()

C:\Users\dawit\AppData\Local\Temp\ipykernel_4132\2025624175.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  japan_events = japan_events.resample('D').mean()

In [17]:
japan_events.head()

            GoldSteinScale  NumMentions
SQLDATE
2005-04-01           -10.0          7.0
2005-04-02             NaN          NaN
2005-04-03             NaN          NaN
2005-04-04             NaN          NaN
2005-04-05           -10.0          6.0

In [18]:
japan_events.shape

(6665, 2)

Check Missing Values

In [19]:
missing_values_loc = pd.isna(japan_events).any(axis=1)

missing_values = japan_events[missing_values_loc]
missing_values.shape

(3247, 2)

In [20]:
japan_events.fillna(0, inplace=True)

In [21]:
japan_events.head()

            GoldSteinScale  NumMentions
SQLDATE
2005-04-01           -10.0          7.0
2005-04-02             0.0          0.0
2005-04-03             0.0          0.0
2005-04-04             0.0          0.0
2005-04-05           -10.0          6.0

Renaming Columns

In [22]:
japan_events.rename(columns={"GoldSteinScale": "JPGoldSteinScale", "NumMentions": "JPNumMentions"}, inplace=True)

In [23]:
japan_events.head()

            JPGoldSteinScale  JPNumMentions
SQLDATE
2005-04-01             -10.0            7.0
2005-04-02               0.0            0.0
2005-04-03               0.0            0.0
2005-04-04               0.0            0.0
2005-04-05             -10.0            6.0

In [24]:
japan_events.shape

(6665, 2)

In [25]:
japan_events.to_csv("prepared_events_Japan.csv", index="None")